#### Terraform Initialization ⚙️`success`

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_iam_policy.create_role will be destroyed
  # (because aws_iam_policy.create_role is not in configuration)
  - resource "aws_iam_policy" "create_role" {
      - arn         = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/CreateRoles" -> null
      - description = "Policy that allows the creation of roles" -> null
      - id          = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/CreateRoles" -> null
      - name        = "CreateRoles" -> null
      - path        = "/IacGhcPipelineResourceManagerPolicy/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "iam:PutRolePolicy",
                          - "iam:CreateRole",
                          - "iam:AttachRolePolicy",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::327110749334:role/IacGhcPipelineResourceManagerRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPAUYKKR5SLE5TQDSSGD" -> null
      - tags        = {} -> null
      - tags_all    = {
          - "Developer"      = "StratusGrid"
          - "Environment"    = "dev"
          - "Provisioner"    = "Terraform"
          - "Region_Purpose" = "Active"
          - "SourceRepo"     = "https://github.com/jasonlll88/test-account-starter-permissions"
          - "Terraform"      = "true"
        } -> null
    }

  # aws_iam_policy.manage_roles will be created
  + resource "aws_iam_policy" "manage_roles" {
      + arn         = (known after apply)
      + description = "Policy that allows the creation of roles"
      + id          = (known after apply)
      + name        = "CreateRoles"
      + name_prefix = (known after apply)
      + path        = "/IacGhcPipelineResourceManagerPolicy/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "iam:PutRolePolicy",
                          + "iam:CreateRole",
                          + "iam:AttachRolePolicy",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:iam::327110749334:role/IacGhcPipelineResourceManagerRole/test_role"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Developer"      = "StratusGrid"
          + "Environment"    = "dev"
          + "Provisioner"    = "Terraform"
          + "Region_Purpose" = "Active"
          + "SourceRepo"     = "https://github.com/jasonlll88/test-account-starter-permissions"
          + "Terraform"      = "true"
        }
    }

  # aws_iam_role_policy_attachment.create_role will be destroyed
  # (because aws_iam_role_policy_attachment.create_role is not in configuration)
  - resource "aws_iam_role_policy_attachment" "create_role" {
      - id         = "IacGhcPipelineResourceManagerRole-20240315181925120400000001" -> null
      - policy_arn = "arn:aws:iam::327110749334:policy/IacGhcPipelineResourceManagerPolicy/CreateRoles" -> null
      - role       = "IacGhcPipelineResourceManagerRole" -> null
    }

  # aws_iam_role_policy_attachment.manage_roles will be created
  + resource "aws_iam_role_policy_attachment" "manage_roles" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "IacGhcPipelineResourceManagerRole"
    }

Plan: 2 to add, 0 to change, 2 to destroy.

```

</details>
            

*Pusher: @jheison-rodriguez, Action: `pull_request`, Working Directory: `/home/runner/work/example-terraform-account-starter-implementation/example-terraform-account-starter-implementation`, Workflow: `Terraform Deployment`*
